MikroElektronika/core_packages/ARM/gcc_clang/system/src/sam/atsamv71q21rt/thirdparty/atsamv71q21rt/component/mcan.h
/* -------- MCAN_TXEFE_0 : (MCAN Offset: 0x00) (R/W 32) Tx Event FIFO Element 0 -------- */
#define MCAN_TXEFE_0_ID_Pos                   _UINT32_(0)                                          /* (MCAN_TXEFE_0) Identifier Position */
#define MCAN_TXEFE_0_ID_Msk                   (_UINT32_(0x1FFFFFFF) << MCAN_TXEFE_0_ID_Pos)        /* (MCAN_TXEFE_0) Identifier Mask */
#define MCAN_TXEFE_0_ID(value)                (MCAN_TXEFE_0_ID_Msk & (_UINT32_(value) << MCAN_TXEFE_0_ID_Pos)) /* Assignment of value for ID in the MCAN_TXEFE_0 register */
#define MCAN_TXEFE_0_RTR_Pos                  _UINT32_(29)                                         /* (MCAN_TXEFE_0) Remote Transmission Request Position */
#define MCAN_TXEFE_0_RTR_Msk                  (_UINT32_(0x1) << MCAN_TXEFE_0_RTR_Pos)              /* (MCAN_TXEFE_0) Remote Transmission Request Mask */
#define MCAN_TXEFE_0_RTR(value)               (MCAN_TXEFE_0_RTR_Msk & (_UINT32_(value) << MCAN_TXEFE_0_RTR_Pos)) /* Assignment of value for RTR in the MCAN_TXEFE_0 register */
#define MCAN_TXEFE_0_XTD_Pos                  _UINT32_(30)                                         /* (MCAN_TXEFE_0) Extended Identifier Position */
#define MCAN_TXEFE_0_XTD_Msk                  (_UINT32_(0x1) << MCAN_TXEFE_0_XTD_Pos)              /* (MCAN_TXEFE_0) Extended Identifier Mask */
#define MCAN_TXEFE_0_XTD(value)               (MCAN_TXEFE_0_XTD_Msk & (_UINT32_(value) << MCAN_TXEFE_0_XTD_Pos)) /* Assignment of value for XTD in the MCAN_TXEFE_0 register */
#define MCAN_TXEFE_0_ESI_Pos                  _UINT32_(31)                                         /* (MCAN_TXEFE_0) Error State Indicator Position */
#define MCAN_TXEFE_0_ESI_Msk                  (_UINT32_(0x1) << MCAN_TXEFE_0_ESI_Pos)              /* (MCAN_TXEFE_0) Error State Indicator Mask */
#define MCAN_TXEFE_0_ESI(value)               (MCAN_TXEFE_0_ESI_Msk & (_UINT32_(value) << MCAN_TXEFE_0_ESI_Pos)) /* Assignment of value for ESI in the MCAN_TXEFE_0 register */
#define MCAN_TXEFE_0_Msk                      _UINT32_(0xFFFFFFFF)                                 /* (MCAN_TXEFE_0) Register Mask  */


/* -------- MCAN_TXEFE_1 : (MCAN Offset: 0x04) (R/W 32) Tx Event FIFO Element 1 -------- */
#define MCAN_TXEFE_1_TXTS_Pos                 _UINT32_(0)                                          /* (MCAN_TXEFE_1) Tx Timestamp Position */
#define MCAN_TXEFE_1_TXTS_Msk                 (_UINT32_(0xFFFF) << MCAN_TXEFE_1_TXTS_Pos)          /* (MCAN_TXEFE_1) Tx Timestamp Mask */
#define MCAN_TXEFE_1_TXTS(value)              (MCAN_TXEFE_1_TXTS_Msk & (_UINT32_(value) << MCAN_TXEFE_1_TXTS_Pos)) /* Assignment of value for TXTS in the MCAN_TXEFE_1 register */
#define MCAN_TXEFE_1_DLC_Pos                  _UINT32_(16)                                         /* (MCAN_TXEFE_1) Data Length Code Position */
#define MCAN_TXEFE_1_DLC_Msk                  (_UINT32_(0xF) << MCAN_TXEFE_1_DLC_Pos)              /* (MCAN_TXEFE_1) Data Length Code Mask */
#define MCAN_TXEFE_1_DLC(value)               (MCAN_TXEFE_1_DLC_Msk & (_UINT32_(value) << MCAN_TXEFE_1_DLC_Pos)) /* Assignment of value for DLC in the MCAN_TXEFE_1 register */
#define MCAN_TXEFE_1_BRS_Pos                  _UINT32_(20)                                         /* (MCAN_TXEFE_1) Bit Rate Switch Position */
#define MCAN_TXEFE_1_BRS_Msk                  (_UINT32_(0x1) << MCAN_TXEFE_1_BRS_Pos)              /* (MCAN_TXEFE_1) Bit Rate Switch Mask */
#define MCAN_TXEFE_1_BRS(value)               (MCAN_TXEFE_1_BRS_Msk & (_UINT32_(value) << MCAN_TXEFE_1_BRS_Pos)) /* Assignment of value for BRS in the MCAN_TXEFE_1 register */
#define MCAN_TXEFE_1_FDF_Pos                  _UINT32_(21)                                         /* (MCAN_TXEFE_1) FD Format Position */
#define MCAN_TXEFE_1_FDF_Msk                  (_UINT32_(0x1) << MCAN_TXEFE_1_FDF_Pos)              /* (MCAN_TXEFE_1) FD Format Mask */
#define MCAN_TXEFE_1_FDF(value)               (MCAN_TXEFE_1_FDF_Msk & (_UINT32_(value) << MCAN_TXEFE_1_FDF_Pos)) /* Assignment of value for FDF in the MCAN_TXEFE_1 register */
#define MCAN_TXEFE_1_ET_Pos                   _UINT32_(22)                                         /* (MCAN_TXEFE_1) Event Type Position */
#define MCAN_TXEFE_1_ET_Msk                   (_UINT32_(0x3) << MCAN_TXEFE_1_ET_Pos)               /* (MCAN_TXEFE_1) Event Type Mask */
#define MCAN_TXEFE_1_ET(value)                (MCAN_TXEFE_1_ET_Msk & (_UINT32_(value) << MCAN_TXEFE_1_ET_Pos)) /* Assignment of value for ET in the MCAN_TXEFE_1 register */
#define   MCAN_TXEFE_1_ET_TXE_Val             _UINT32_(0x1)                                        /* (MCAN_TXEFE_1) Tx event  */
#define   MCAN_TXEFE_1_ET_TXC_Val             _UINT32_(0x2)                                        /* (MCAN_TXEFE_1) Transmission in spite of cancellation  */
#define MCAN_TXEFE_1_ET_TXE                   (MCAN_TXEFE_1_ET_TXE_Val << MCAN_TXEFE_1_ET_Pos)     /* (MCAN_TXEFE_1) Tx event Position */
#define MCAN_TXEFE_1_ET_TXC                   (MCAN_TXEFE_1_ET_TXC_Val << MCAN_TXEFE_1_ET_Pos)     /* (MCAN_TXEFE_1) Transmission in spite of cancellation Position */
#define MCAN_TXEFE_1_MM_Pos                   _UINT32_(24)                                         /* (MCAN_TXEFE_1) Message Marker Position */
#define MCAN_TXEFE_1_MM_Msk                   (_UINT32_(0xFF) << MCAN_TXEFE_1_MM_Pos)              /* (MCAN_TXEFE_1) Message Marker Mask */
#define MCAN_TXEFE_1_MM(value)                (MCAN_TXEFE_1_MM_Msk & (_UINT32_(value) << MCAN_TXEFE_1_MM_Pos)) /* Assignment of value for MM in the MCAN_TXEFE_1 register */
#define MCAN_TXEFE_1_Msk                      _UINT32_(0xFFFFFFFF)                                 /* (MCAN_TXEFE_1) Register Mask  */


/* -------- MCAN_SIDFE_0 : (MCAN Offset: 0x00) (R/W 32) Standard Message ID Filter Element 0 -------- */
#define MCAN_SIDFE_0_SFID2_Pos                _UINT32_(0)                                          /* (MCAN_SIDFE_0) Standard Filter ID 2 Position */
#define MCAN_SIDFE_0_SFID2_Msk                (_UINT32_(0x7FF) << MCAN_SIDFE_0_SFID2_Pos)          /* (MCAN_SIDFE_0) Standard Filter ID 2 Mask */
#define MCAN_SIDFE_0_SFID2(value)             (MCAN_SIDFE_0_SFID2_Msk & (_UINT32_(value) << MCAN_SIDFE_0_SFID2_Pos)) /* Assignment of value for SFID2 in the MCAN_SIDFE_0 register */
#define MCAN_SIDFE_0_SFID1_Pos                _UINT32_(16)                                         /* (MCAN_SIDFE_0) Standard Filter ID 1 Position */
#define MCAN_SIDFE_0_SFID1_Msk                (_UINT32_(0x7FF) << MCAN_SIDFE_0_SFID1_Pos)          /* (MCAN_SIDFE_0) Standard Filter ID 1 Mask */
#define MCAN_SIDFE_0_SFID1(value)             (MCAN_SIDFE_0_SFID1_Msk & (_UINT32_(value) << MCAN_SIDFE_0_SFID1_Pos)) /* Assignment of value for SFID1 in the MCAN_SIDFE_0 register */
#define MCAN_SIDFE_0_SFEC_Pos                 _UINT32_(27)                                         /* (MCAN_SIDFE_0) Standard Filter Element Configuration Position */
#define MCAN_SIDFE_0_SFEC_Msk                 (_UINT32_(0x7) << MCAN_SIDFE_0_SFEC_Pos)             /* (MCAN_SIDFE_0) Standard Filter Element Configuration Mask */
#define MCAN_SIDFE_0_SFEC(value)              (MCAN_SIDFE_0_SFEC_Msk & (_UINT32_(value) << MCAN_SIDFE_0_SFEC_Pos)) /* Assignment of value for SFEC in the MCAN_SIDFE_0 register */
#define   MCAN_SIDFE_0_SFEC_DISABLE_Val       _UINT32_(0x0)                                        /* (MCAN_SIDFE_0) Disable filter element  */
#define   MCAN_SIDFE_0_SFEC_STF0M_Val         _UINT32_(0x1)                                        /* (MCAN_SIDFE_0) Store in Rx FIFO 0 if filter matches  */
#define   MCAN_SIDFE_0_SFEC_STF1M_Val         _UINT32_(0x2)                                        /* (MCAN_SIDFE_0) Store in Rx FIFO 1 if filter matches  */
#define   MCAN_SIDFE_0_SFEC_REJECT_Val        _UINT32_(0x3)                                        /* (MCAN_SIDFE_0) Reject ID if filter matches  */
#define   MCAN_SIDFE_0_SFEC_PRIORITY_Val      _UINT32_(0x4)                                        /* (MCAN_SIDFE_0) Set priority if filter matches  */
#define   MCAN_SIDFE_0_SFEC_PRIF0M_Val        _UINT32_(0x5)                                        /* (MCAN_SIDFE_0) Set priority and store in FIFO 0 if filter matches  */
#define   MCAN_SIDFE_0_SFEC_PRIF1M_Val        _UINT32_(0x6)                                        /* (MCAN_SIDFE_0) Set priority and store in FIFO 1 if filter matches  */
#define   MCAN_SIDFE_0_SFEC_STRXBUF_Val       _UINT32_(0x7)                                        /* (MCAN_SIDFE_0) Store into Rx Buffer  */
#define MCAN_SIDFE_0_SFEC_DISABLE             (MCAN_SIDFE_0_SFEC_DISABLE_Val << MCAN_SIDFE_0_SFEC_Pos) /* (MCAN_SIDFE_0) Disable filter element Position */
#define MCAN_SIDFE_0_SFEC_STF0M               (MCAN_SIDFE_0_SFEC_STF0M_Val << MCAN_SIDFE_0_SFEC_Pos) /* (MCAN_SIDFE_0) Store in Rx FIFO 0 if filter matches Position */
#define MCAN_SIDFE_0_SFEC_STF1M               (MCAN_SIDFE_0_SFEC_STF1M_Val << MCAN_SIDFE_0_SFEC_Pos) /* (MCAN_SIDFE_0) Store in Rx FIFO 1 if filter matches Position */
#define MCAN_SIDFE_0_SFEC_REJECT              (MCAN_SIDFE_0_SFEC_REJECT_Val << MCAN_SIDFE_0_SFEC_Pos) /* (MCAN_SIDFE_0) Reject ID if filter matches Position */
#define MCAN_SIDFE_0_SFEC_PRIORITY            (MCAN_SIDFE_0_SFEC_PRIORITY_Val << MCAN_SIDFE_0_SFEC_Pos) /* (MCAN_SIDFE_0) Set priority if filter matches Position */
#define MCAN_SIDFE_0_SFEC_PRIF0M              (MCAN_SIDFE_0_SFEC_PRIF0M_Val << MCAN_SIDFE_0_SFEC_Pos) /* (MCAN_SIDFE_0) Set priority and store in FIFO 0 if filter matches Position */
#define MCAN_SIDFE_0_SFEC_PRIF1M              (MCAN_SIDFE_0_SFEC_PRIF1M_Val << MCAN_SIDFE_0_SFEC_Pos) /* (MCAN_SIDFE_0) Set priority and store in FIFO 1 if filter matches Position */
#define MCAN_SIDFE_0_SFEC_STRXBUF             (MCAN_SIDFE_0_SFEC_STRXBUF_Val << MCAN_SIDFE_0_SFEC_Pos) /* (MCAN_SIDFE_0) Store into Rx Buffer Position */
#define MCAN_SIDFE_0_SFT_Pos                  _UINT32_(30)                                         /* (MCAN_SIDFE_0) Standard Filter Type Position */
#define MCAN_SIDFE_0_SFT_Msk                  (_UINT32_(0x3) << MCAN_SIDFE_0_SFT_Pos)              /* (MCAN_SIDFE_0) Standard Filter Type Mask */
#define MCAN_SIDFE_0_SFT(value)               (MCAN_SIDFE_0_SFT_Msk & (_UINT32_(value) << MCAN_SIDFE_0_SFT_Pos)) /* Assignment of value for SFT in the MCAN_SIDFE_0 register */
#define   MCAN_SIDFE_0_SFT_RANGE_Val          _UINT32_(0x0)                                        /* (MCAN_SIDFE_0) Range filter from SFID1 to SFID2  */
#define   MCAN_SIDFE_0_SFT_DUAL_Val           _UINT32_(0x1)                                        /* (MCAN_SIDFE_0) Dual ID filter for SF1ID or SF2ID  */
#define   MCAN_SIDFE_0_SFT_CLASSIC_Val        _UINT32_(0x2)                                        /* (MCAN_SIDFE_0) Classic filter  */
#define MCAN_SIDFE_0_SFT_RANGE                (MCAN_SIDFE_0_SFT_RANGE_Val << MCAN_SIDFE_0_SFT_Pos) /* (MCAN_SIDFE_0) Range filter from SFID1 to SFID2 Position */
#define MCAN_SIDFE_0_SFT_DUAL                 (MCAN_SIDFE_0_SFT_DUAL_Val << MCAN_SIDFE_0_SFT_Pos)  /* (MCAN_SIDFE_0) Dual ID filter for SF1ID or SF2ID Position */
#define MCAN_SIDFE_0_SFT_CLASSIC              (MCAN_SIDFE_0_SFT_CLASSIC_Val << MCAN_SIDFE_0_SFT_Pos) /* (MCAN_SIDFE_0) Classic filter Position */
#define MCAN_SIDFE_0_Msk                      _UINT32_(0xFFFF07FF)                                 /* (MCAN_SIDFE_0) Register Mask  */


/* -------- MCAN_XIDFE_0 : (MCAN Offset: 0x00) (R/W 32) Extended Message ID Filter Element 0 -------- */
#define MCAN_XIDFE_0_EFID1_Pos                _UINT32_(0)                                          /* (MCAN_XIDFE_0) Extended Filter ID 1 Position */
#define MCAN_XIDFE_0_EFID1_Msk                (_UINT32_(0x1FFFFFFF) << MCAN_XIDFE_0_EFID1_Pos)     /* (MCAN_XIDFE_0) Extended Filter ID 1 Mask */
#define MCAN_XIDFE_0_EFID1(value)             (MCAN_XIDFE_0_EFID1_Msk & (_UINT32_(value) << MCAN_XIDFE_0_EFID1_Pos)) /* Assignment of value for EFID1 in the MCAN_XIDFE_0 register */
#define MCAN_XIDFE_0_EFEC_Pos                 _UINT32_(29)                                         /* (MCAN_XIDFE_0) Extended Filter Element Configuration Position */
#define MCAN_XIDFE_0_EFEC_Msk                 (_UINT32_(0x7) << MCAN_XIDFE_0_EFEC_Pos)             /* (MCAN_XIDFE_0) Extended Filter Element Configuration Mask */
#define MCAN_XIDFE_0_EFEC(value)              (MCAN_XIDFE_0_EFEC_Msk & (_UINT32_(value) << MCAN_XIDFE_0_EFEC_Pos)) /* Assignment of value for EFEC in the MCAN_XIDFE_0 register */
#define   MCAN_XIDFE_0_EFEC_DISABLE_Val       _UINT32_(0x0)                                        /* (MCAN_XIDFE_0) Disable filter element  */
#define   MCAN_XIDFE_0_EFEC_STF0M_Val         _UINT32_(0x1)                                        /* (MCAN_XIDFE_0) Store in Rx FIFO 0 if filter matches  */
#define   MCAN_XIDFE_0_EFEC_STF1M_Val         _UINT32_(0x2)                                        /* (MCAN_XIDFE_0) Store in Rx FIFO 1 if filter matches  */
#define   MCAN_XIDFE_0_EFEC_REJECT_Val        _UINT32_(0x3)                                        /* (MCAN_XIDFE_0) Reject ID if filter matches  */
#define   MCAN_XIDFE_0_EFEC_PRIORITY_Val      _UINT32_(0x4)                                        /* (MCAN_XIDFE_0) Set priority if filter matches  */
#define   MCAN_XIDFE_0_EFEC_PRIF0M_Val        _UINT32_(0x5)                                        /* (MCAN_XIDFE_0) Set priority and store in FIFO 0 if filter matches  */
#define   MCAN_XIDFE_0_EFEC_PRIF1M_Val        _UINT32_(0x6)                                        /* (MCAN_XIDFE_0) Set priority and store in FIFO 1 if filter matches  */
#define   MCAN_XIDFE_0_EFEC_STRXBUF_Val       _UINT32_(0x7)                                        /* (MCAN_XIDFE_0) Store into Rx Buffer  */
#define MCAN_XIDFE_0_EFEC_DISABLE             (MCAN_XIDFE_0_EFEC_DISABLE_Val << MCAN_XIDFE_0_EFEC_Pos) /* (MCAN_XIDFE_0) Disable filter element Position */
#define MCAN_XIDFE_0_EFEC_STF0M               (MCAN_XIDFE_0_EFEC_STF0M_Val << MCAN_XIDFE_0_EFEC_Pos) /* (MCAN_XIDFE_0) Store in Rx FIFO 0 if filter matches Position */
#define MCAN_XIDFE_0_EFEC_STF1M               (MCAN_XIDFE_0_EFEC_STF1M_Val << MCAN_XIDFE_0_EFEC_Pos) /* (MCAN_XIDFE_0) Store in Rx FIFO 1 if filter matches Position */
#define MCAN_XIDFE_0_EFEC_REJECT              (MCAN_XIDFE_0_EFEC_REJECT_Val << MCAN_XIDFE_0_EFEC_Pos) /* (MCAN_XIDFE_0) Reject ID if filter matches Position */
#define MCAN_XIDFE_0_EFEC_PRIORITY            (MCAN_XIDFE_0_EFEC_PRIORITY_Val << MCAN_XIDFE_0_EFEC_Pos) /* (MCAN_XIDFE_0) Set priority if filter matches Position */
#define MCAN_XIDFE_0_EFEC_PRIF0M              (MCAN_XIDFE_0_EFEC_PRIF0M_Val << MCAN_XIDFE_0_EFEC_Pos) /* (MCAN_XIDFE_0) Set priority and store in FIFO 0 if filter matches Position */
#define MCAN_XIDFE_0_EFEC_PRIF1M              (MCAN_XIDFE_0_EFEC_PRIF1M_Val << MCAN_XIDFE_0_EFEC_Pos) /* (MCAN_XIDFE_0) Set priority and store in FIFO 1 if filter matches Position */
#define MCAN_XIDFE_0_EFEC_STRXBUF             (MCAN_XIDFE_0_EFEC_STRXBUF_Val << MCAN_XIDFE_0_EFEC_Pos) /* (MCAN_XIDFE_0) Store into Rx Buffer Position */
#define MCAN_XIDFE_0_Msk                      _UINT32_(0xFFFFFFFF)                                 /* (MCAN_XIDFE_0) Register Mask  */


/* -------- MCAN_XIDFE_1 : (MCAN Offset: 0x04) (R/W 32) Extended Message ID Filter Element 1 -------- */
#define MCAN_XIDFE_1_EFID2_Pos                _UINT32_(0)                                          /* (MCAN_XIDFE_1) Extended Filter ID 2 Position */
#define MCAN_XIDFE_1_EFID2_Msk                (_UINT32_(0x1FFFFFFF) << MCAN_XIDFE_1_EFID2_Pos)     /* (MCAN_XIDFE_1) Extended Filter ID 2 Mask */
#define MCAN_XIDFE_1_EFID2(value)             (MCAN_XIDFE_1_EFID2_Msk & (_UINT32_(value) << MCAN_XIDFE_1_EFID2_Pos)) /* Assignment of value for EFID2 in the MCAN_XIDFE_1 register */
#define MCAN_XIDFE_1_EFT_Pos                  _UINT32_(30)                                         /* (MCAN_XIDFE_1) Extended Filter Type Position */
#define MCAN_XIDFE_1_EFT_Msk                  (_UINT32_(0x3) << MCAN_XIDFE_1_EFT_Pos)              /* (MCAN_XIDFE_1) Extended Filter Type Mask */
#define MCAN_XIDFE_1_EFT(value)               (MCAN_XIDFE_1_EFT_Msk & (_UINT32_(value) << MCAN_XIDFE_1_EFT_Pos)) /* Assignment of value for EFT in the MCAN_XIDFE_1 register */
#define   MCAN_XIDFE_1_EFT_RANGE_Val          _UINT32_(0x0)                                        /* (MCAN_XIDFE_1) Range filter from EFID1 to EFID2  */
#define   MCAN_XIDFE_1_EFT_DUAL_Val           _UINT32_(0x1)                                        /* (MCAN_XIDFE_1) Dual ID filter for EFID1 or EFID2  */
#define   MCAN_XIDFE_1_EFT_CLASSIC_Val        _UINT32_(0x2)                                        /* (MCAN_XIDFE_1) Classic filter  */
#define   MCAN_XIDFE_1_EFT_RANGE_NO_XIDAM_Val _UINT32_(0x3)                                        /* (MCAN_XIDFE_1) Range filter from EFID1 to EFID2 with no XIDAM mask  */
#define MCAN_XIDFE_1_EFT_RANGE                (MCAN_XIDFE_1_EFT_RANGE_Val << MCAN_XIDFE_1_EFT_Pos) /* (MCAN_XIDFE_1) Range filter from EFID1 to EFID2 Position */
#define MCAN_XIDFE_1_EFT_DUAL                 (MCAN_XIDFE_1_EFT_DUAL_Val << MCAN_XIDFE_1_EFT_Pos)  /* (MCAN_XIDFE_1) Dual ID filter for EFID1 or EFID2 Position */
#define MCAN_XIDFE_1_EFT_CLASSIC              (MCAN_XIDFE_1_EFT_CLASSIC_Val << MCAN_XIDFE_1_EFT_Pos) /* (MCAN_XIDFE_1) Classic filter Position */
#define MCAN_XIDFE_1_EFT_RANGE_NO_XIDAM       (MCAN_XIDFE_1_EFT_RANGE_NO_XIDAM_Val << MCAN_XIDFE_1_EFT_Pos) /* (MCAN_XIDFE_1) Range filter from EFID1 to EFID2 with no XIDAM mask Position */
#define MCAN_XIDFE_1_Msk                      _UINT32_(0xDFFFFFFF)                                 /* (MCAN_XIDFE_1) Register Mask  */


/* -------- MCAN_CREL : (MCAN Offset: 0x00) ( R/ 32) Core Release Register -------- */
#define MCAN_CREL_DAY_Pos                     _UINT32_(0)                                          /* (MCAN_CREL) Timestamp Day Position */
#define MCAN_CREL_DAY_Msk                     (_UINT32_(0xFF) << MCAN_CREL_DAY_Pos)                /* (MCAN_CREL) Timestamp Day Mask */
#define MCAN_CREL_DAY(value)                  (MCAN_CREL_DAY_Msk & (_UINT32_(value) << MCAN_CREL_DAY_Pos)) /* Assignment of value for DAY in the MCAN_CREL register */
#define MCAN_CREL_MON_Pos                     _UINT32_(8)                                          /* (MCAN_CREL) Timestamp Month Position */
#define MCAN_CREL_MON_Msk                     (_UINT32_(0xFF) << MCAN_CREL_MON_Pos)                /* (MCAN_CREL) Timestamp Month Mask */
#define MCAN_CREL_MON(value)                  (MCAN_CREL_MON_Msk & (_UINT32_(value) << MCAN_CREL_MON_Pos)) /* Assignment of value for MON in the MCAN_CREL register */
#define MCAN_CREL_YEAR_Pos                    _UINT32_(16)                                         /* (MCAN_CREL) Timestamp Year Position */
#define MCAN_CREL_YEAR_Msk                    (_UINT32_(0xF) << MCAN_CREL_YEAR_Pos)                /* (MCAN_CREL) Timestamp Year Mask */
#define MCAN_CREL_YEAR(value)                 (MCAN_CREL_YEAR_Msk & (_UINT32_(value) << MCAN_CREL_YEAR_Pos)) /* Assignment of value for YEAR in the MCAN_CREL register */
#define MCAN_CREL_SUBSTEP_Pos                 _UINT32_(20)                                         /* (MCAN_CREL) Sub-step of Core Release Position */
#define MCAN_CREL_SUBSTEP_Msk                 (_UINT32_(0xF) << MCAN_CREL_SUBSTEP_Pos)             /* (MCAN_CREL) Sub-step of Core Release Mask */
#define MCAN_CREL_SUBSTEP(value)              (MCAN_CREL_SUBSTEP_Msk & (_UINT32_(value) << MCAN_CREL_SUBSTEP_Pos)) /* Assignment of value for SUBSTEP in the MCAN_CREL register */
#define MCAN_CREL_STEP_Pos                    _UINT32_(24)                                         /* (MCAN_CREL) Step of Core Release Position */
#define MCAN_CREL_STEP_Msk                    (_UINT32_(0xF) << MCAN_CREL_STEP_Pos)                /* (MCAN_CREL) Step of Core Release Mask */
#define MCAN_CREL_STEP(value)                 (MCAN_CREL_STEP_Msk & (_UINT32_(value) << MCAN_CREL_STEP_Pos)) /* Assignment of value for STEP in the MCAN_CREL register */
#define MCAN_CREL_REL_Pos                     _UINT32_(28)                                         /* (MCAN_CREL) Core Release Position */
#define MCAN_CREL_REL_Msk                     (_UINT32_(0xF) << MCAN_CREL_REL_Pos)                 /* (MCAN_CREL) Core Release Mask */
#define MCAN_CREL_REL(value)                  (MCAN_CREL_REL_Msk & (_UINT32_(value) << MCAN_CREL_REL_Pos)) /* Assignment of value for REL in the MCAN_CREL register */
#define MCAN_CREL_Msk                         _UINT32_(0xFFFFFFFF)                                 /* (MCAN_CREL) Register Mask  */


/* -------- MCAN_ENDN : (MCAN Offset: 0x04) ( R/ 32) Endian Register -------- */
#define MCAN_ENDN_ETV_Pos                     _UINT32_(0)                                          /* (MCAN_ENDN) Endianness Test Value Position */
#define MCAN_ENDN_ETV_Msk                     (_UINT32_(0xFFFFFFFF) << MCAN_ENDN_ETV_Pos)          /* (MCAN_ENDN) Endianness Test Value Mask */
#define MCAN_ENDN_ETV(value)                  (MCAN_ENDN_ETV_Msk & (_UINT32_(value) << MCAN_ENDN_ETV_Pos)) /* Assignment of value for ETV in the MCAN_ENDN register */
#define MCAN_ENDN_Msk                         _UINT32_(0xFFFFFFFF)                                 /* (MCAN_ENDN) Register Mask  */


/* -------- MCAN_CUST : (MCAN Offset: 0x08) (R/W 32) Customer Register -------- */
#define MCAN_CUST_CSV_Pos                     _UINT32_(0)                                          /* (MCAN_CUST) Customer-specific Value Position */
#define MCAN_CUST_CSV_Msk                     (_UINT32_(0xFFFFFFFF) << MCAN_CUST_CSV_Pos)          /* (MCAN_CUST) Customer-specific Value Mask */
#define MCAN_CUST_CSV(value)                  (MCAN_CUST_CSV_Msk & (_UINT32_(value) << MCAN_CUST_CSV_Pos)) /* Assignment of value for CSV in the MCAN_CUST register */
#define MCAN_CUST_Msk                         _UINT32_(0xFFFFFFFF)                                 /* (MCAN_CUST) Register Mask  */


